Autodesk.Revit.DB.ProjectLocation.SetProjectedSpaceToLocalTrf(System.String,Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.XYZ,System.Double,System.Double)
Set the transform from projected space to local space, which is calculated from the given local point, grid point, rotation angle and scale factor.
coordSystem:
the geographic coordinate system
localPoint:
The point in local space.
gridPoint:
The point in projected space.
rotationAngle:
The angle with respect to north (clockwise).
scaleFactor:
The grid scale factor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ProjectLocation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Create an instance of ProjectLocation in the document.
Remarks:
The created instace of ProjectLocation would have the specified name and an identity Transform.
document:
The document where the new instance of ProjectLocation would be created in.
siteLocationId:
The ElementId of the SiteLocation to which the new ProjectLocation would be created.
name:
The name of the instance of ProjectLocation to be created.
Returns:
The newly created instance of ProjectLocation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element siteLocationId does not exist in the document
-or-
name cannot include prohibited characters.
-or-
There is already a ProjectLocation with this name in the given SiteLocation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.ProjectLocation.IsProjectLocationNameUnique(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId)
Verifies that there is no existing ProjectLocation with the given name belonging to the given SiteLocation.
document:
The document to check.
name:
The name to check.
siteLocationId:
The ElementId of the SiteLocation which the ProjectLocation belongs to.
Returns:
True if the name is unused (among ProjectLocations). False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ProjectLocation.IsProjectLocationNameUnique(Autodesk.Revit.DB.Document,System.String)
Verifies that there is no existing ProjectLocation with the given name in the document.
document:
The document to check.
name:
The name to check.
Returns:
True if the name is unused (among ProjectLocations). False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ProjectLocation.Duplicate(System.String)
Generate a copy of this project location with the specified name.
Remarks:
The name must not be the same as the name of any existing locations.
This function will modify the document, as the new ProjectLocation
will be added to it.
Returns:
A new ProjectLocation which is a duplicate of this location, with
the input name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ProjectLocation.GetSiteLocation
Gets the site location to which this project location refers.
Remarks:
The site location object contains the longitude, latitude, and time-zone
of the entire project site.

Autodesk.Revit.DB.ProjectLocation.SetProjectPosition(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ProjectPosition)
Sets the coordinates of a point in the ProjectLocation's coordinate system.
Remarks:
When setting this value, the transformations applied to the location are modified such that the passed point
becomes the specified North/South, East/West and Elevation, and the coordinate transform will have the designated
angular rotation. This is similar to the Revit command "Specify Coordinates at Point".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to use the project position's transform to calculate the point.

Autodesk.Revit.DB.ProjectLocation.GetProjectPosition(Autodesk.Revit.DB.XYZ)
Gets the coordinates of a point in the ProjectLocation's coordinate system.
Remarks:
When getting this value, the North/South, East/West, and Elevation values report the coordinates of the point
similar to the Revit command "Report Shared Coordinates". To get the values of the transformations applied by this
project location, pass XYZ.Zero.
If the project has acquired shared coordinates from a linked model, the shared coordinate transformation will
be reflected in the coordinates of the transformed point returned by this property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to use the project position's transform to calculate the point.

Autodesk.Revit.DB.ProjectLocation
A representation of a specific instance and location of the current project.
Remarks:
When using shared coordinates, ProjectLocations can be used to specify
specific locations for instances of a linked model. A ProjectLocation
keeps track of the position of an instance in relationship to the project's
SiteLocation.
By default, each Revit project contains at least one named location, called Internal.
Existing ProjectLocation objects can be found by using the ProjectLocations property on
the Document object. New project locations can be created by duplicating an existing project
location using the Duplicate method, and modifying the location's project position.
See also Autodesk.Revit.DB.SiteLocation